const express = require("express");
const authorRouter = express.Router();

function author(nav) {




    var books = [
        {
            img: "ravindra.jpeg",
            title: 'Tom and jerry',
            author: 'Ravindra Nath Tagore',
            genre: 'cartoon',
            about: 'ഇന്ത്യയിലെ പ്രമുഖ സാഹിത്യകാരനും സാംസ്കാരികനായകനുമാണ് രബീന്ദ്രനാഥ ടാഗോർ (রবীন্দ্রনাথ ঠাকুর മേയ് 7 1861 – ഓഗസ്റ്റ് 7 1941), ഗുരുദേവ്‌ എന്നും ആദരപൂർവ്വം അദ്ദേഹത്തെ സംബോധന ചെയ്തിരുന്നു. കവി, തത്ത്വചിന്തകൻ, ദൃശ്യകലാകാരൻ, കഥാകൃത്ത്‌, നാടകകൃത്ത്, ഗാനരചയിതാവ്‌, നോവലിസ്റ്റ്, സാമൂഹികപരിഷ്കർത്താവ് തുടങ്ങിയ നിലകളിൽ തന്റെ പ്രതിഭ തെളിയിക്കുകയും ബംഗാളിസാഹിത്യത്തിനും സംഗീതത്തിനും പത്തൊൻപതാം നൂറ്റാണ്ടിന്റെ അന്ത്യത്തിലും, ഇരുപതാം നൂറ്റാണ്ടിന്റെ തുടക്കത്തിലുമായി പുതുരൂപം നൽകുകയും ചെയ്തു. അദ്ദേഹത്തിന്റെ കാവ്യസമാഹാരമായ ഗീതാഞ്ജലിക്ക് 1913-ൽ സാഹിത്യത്തിനുള്ള നോബൽ പുരസ്കാരം ലഭിച്ചതിലൂടെ പ്രസ്തുത പുരസ്കാരം ലഭിക്കുന്ന ഏഷ്യയിലെ ആദ്യവ്യക്തിയായി ടാഗോർ.'
        },
        {
            img: "rowling.jpg",
            title: 'dhurandham',
            author: 'Rowling',
            genre: 'family',
            about: 'ഹാരി പോട്ടർ മാന്ത്രിക കഥകളുടെ സ്രഷ്ടാവാണ് ജെ.കെ. റൗളിങ് അഥവാ ജോവാൻ റൌളിംഗ് . 1990- ൽ മാഞ്ജസ്റ്ററിൽ നിന്നും ലണ്ടൻ വരെ നടത്തിയ തീവണ്ടി യാത്രയ്ക്കിടയിലാണ് കഥ എഴുതാനുള്ള പ്രചോദനം റോളിങ്ങിനു ലഭിച്ചത്, . ഹാരി പോട്ടർ പുസ്തകങ്ങൾ ഇന്ന് ലോകപ്രശസ്തമാണ്. 40 കോടി ഹാരി പോട്ടർ പുസ്തകങ്ങൾ ലോകമെമ്പാടും വിറ്റഴിഞ്ഞിട്ടുണ്ട്. ഈ പുസ്തകങ്ങൾ സിനിമകളായും ആവിഷ്ക്കരിക്കപ്പെട്ടിട്ടുണ്ട്. ഇവയിൽ ആദ്യ രണ്ടു ചലച്ചിത്രങ്ങളിൽ കലാസംവിധാനം നിർവഹിച്ചത് റൌളിംഗ് തന്നെ ആയിരുന്നു'
        },
        {
            img: "mt.jpeg",
            title: 'Tom and jerry',
            author: 'MT Vasudevan',
            genre: 'cartoon',
            about: 'നോവലിസ്റ്റ്‌, തിരക്കഥാകൃത്ത്‌, ചലച്ചിത്രസംവിധായകൻ, സാഹിത്യകാരൻ, നാടകകൃത്ത് എന്നീ നിലകളിൽ പ്രശസ്തനായ മലയാളിയാണ് മാടത്ത്  തെക്കേപ്പാട്ട് വാസുദേവൻ നായർ എന്ന എം.ടി. വാസുദേവൻ നായർ (ജനനം: 1933). മലയാളസാഹിത്യത്തിലും ചലച്ചിത്രരംഗത്തും വ്യക്തിമുദ്ര പതിപ്പിച്ച ഇദ്ദേഹം എം.ടി എന്ന ചുരുക്കപ്പേരിൽ അറിയപ്പെടുന്നു. അദ്ധ്യാപകൻ, പത്രാധിപൻ, എന്നീ നിലകളിലും പ്രവർത്തിച്ച ഇദ്ദേഹത്തിന് പത്മഭൂഷൺ, ജ്ഞാനപീഠം എന്നിവയുൾപ്പെടെ ഒട്ടേറെ പുരസ്കാരങ്ങളും ലഭിച്ചിട്ടുണ്ട്.'
        },
        {
            img: "sugatha.jpeg",
            title: 'Tom and jerry',
            author: 'Sugatha Kumari',
            genre: 'cartoon',
            about: 'മലയാളത്തിലെ പ്രശസ്ത കവയിത്രിയും കേരളത്തിന്റെ പ്രശ്നങ്ങളിൽ ശ്രദ്ധാലുവായ സാമൂഹിക, പരിസ്ഥിതി പ്രവർത്തകയുമായിരുന്നു സുഗതകുമാരി. സ്വാതന്ത്ര്യസമര സേനാനിയും കവിയുമായിരുന്ന ബാേധേശ്വരന്റെയും സംസ്കൃത പണ്ഡിതയായ വി.കെ കാർത്ത്യായനിയമ്മയുടെയും മകളാണ്. കേരള സംസ്ഥാന വനിതാ കമ്മീഷന്റെ മുൻ ചെയർപേഴ്സണായിരുന്നു. പ്രകൃതി സംരക്ഷണ സമിതിയുടെയും, അഗതികളായ വനിതകൾക്കും മാനസികവെെകല്യമുള്ളവർക്കും ഡേ കെയർ സെൻ്ററായി പ്രവർത്തിക്കുന്ന അഭയ എന്ന സ്ഥാപനത്തിന്റെയും സ്ഥാപക സെക്രട്ടറിയാണ് ഇവർ. സേവ് സൈലൻറ് വാലി പ്രതിഷേധത്തിൽ വലിയ പങ്കുവഹിച്ചു. 2020 ഡിസംബർ 23-ന് മരണമടഞ്ഞു.'

        },
    ];

    authorRouter.get('/', (req, res) => {
        res.render("glassauthor",
            {
                nav,
                title: 'Library',
                books

            });
    });
    authorRouter.get('/addauthors', (req, res) => {
        res.render("addauthor",
            {
                nav,
                title: 'Library',
                books

            });
    });
    authorRouter.get('/add', (req, res) => {
        res.send("Author added successfully");
            
    });

    // booksRouter.get('/single',(req,res)=>{
    //     res.send("hai hallo how r u")
    // });
    authorRouter.get('/:id', (req, res) => {
        const id = req.params.id;
        res.render("glassauthor1", {
            nav,
            title: 'Library',
            book: books[id]
        })
    });
    return authorRouter;
}
module.exports = author;